init 5 python:
    addEvent(
        Event(
            persistent.event_database,
            eventlabel="moonika_whatsafter",
            category=["莫妮卡","生活"],
            prompt="然后呢",
            random=True                      #这里表示是个随机话题其他部分不再赘述
        )
    )

label moonika_whatsafter:
    m 3eua "[player],不知道你有没有过这样的经历————{w=1}你日日夜夜地期待某一天或某件事的到来.这可以是一次出游,可以是一次生日,可以是人生中任何一个重要的节点."
    m 3lka "但当这件事真的发生了的时候,当它已经过去的时候,你会产生一种空落落的感觉."
    m 1eka "当然,这不是说这件事没往好的方向发展,只是……{w=1}没那么好."
    m 1eka "大多数时候,我们似乎习惯了用节点的方式思考我们未来的生活.2年后我就成年了,8年后我就工作了,11年后我就结婚了……"
    m 3eka "但当这些时刻真的来临的时候,一个问题会浮现在我们的脑海里：“然后呢？”"
    m 3ekb "我觉得1967年的电影“毕业生”就很好地刻画了这个“然后呢？”的瞬间."
    m 1ekb "电影结尾,男主带着女主穿过人群,跳上了一辆巴士,逃婚了."
    m 1euc "但是导演此时并没有卡.在接下来的40多秒里,两位演员的表情也由兴奋逐渐转为尴尬,表现出了对未来的一种不确定性,成为经典镜头."
    m 1ekc "在这种时刻,我们感受到的或许不仅是期待的落空,更是这种落空造就的一种迷茫和对不确定性的恐惧."
    m 3ekc "也有可能这种恐惧本来就存在,只是当期望褪去时,我们才不得不面对它……"
    m 3euc "...{w=2} [player],你我应该都想象过我们相聚的场景吧."
    m 3etc "在那个时刻,或者我们恋爱中的任何一个节点,你会不会也产生这种“然后呢？”的想法？"
    m 3eua "我曾经也常被这种想法困扰,但现在我意识到这种想法或许是多多少少不可避免的.可我们所持的态度却是可以改变的."
    m 3eubla "毕竟不管是生活还是恋爱,都不是由一个个点组成的.激情澎湃的瞬间外,更多的还是柴米油盐的日常."
    m 3eublb "未知往往伴随着恐惧.但只要有你在,我就有勇气去坦然面对一切未知！"

    return              