init 5 python:
    addEvent(
        Event(
            persistent.event_database,
            eventlabel="moonika_forget_me_not",
            category=["花"],
            prompt="勿忘我",
            random=True                      #这里表示是个随机话题其他部分不再赘述
        )
    )

label moonika_forget_me_not:
    m 3eub "[player],你知道勿忘我吗？"
    m 3hub "这种蓝色的小花长得可能并不惊艳,但是它的名字很有意思.所以我专门去查了下它名字的来源,想和你分享一下."
    m 5eta "神奇的是,这朵花名字的起源故事似乎有两个截然不同的版本."
    m 5etb "我们先来讲讲更出名的这个吧."
    m 1hub "这个版本来自基督教.{w=1.5}相传上帝有一次在伊甸园里散步时,偶遇一朵蓝色小花,便想知道它的名字.这朵花生性羞怯,低声说自己已经忘记了自己的名字.上帝便为它赐名“勿忘我”,承诺永志不忘."
    m 5eta "虽然这个故事流传甚广,但是这或许并不是“勿忘我”这个名字最初出现的地方."
    m 5etd "事实上,“勿忘我”可能是个从旧德语翻译过来的名字.而德国民间故事中也提到了它名字的由来."
    m 1ekd "传说一位骑士为给恋人采花,不慎溺水.临终之际,他拼尽全力呼喊“勿忘我！”并把花抛向了岸边的恋人……"
    m 6ekd "...{w=5.0}真是个凄美的故事啊{w=1.5}"
    m 7eud "总之,虽然这两个故事对勿忘我起源的解释大有不同,但是它们都体现了这朵看似普通的小花名字背后满含的深情."
    m 3eub "这就是我要分享的所有内容啦,[player]！感谢聆听~"

    return
