init 5 python:
    addEvent(
        Event(
            persistent.event_database,
            eventlabel="moonika_infinity",
            category=["数学"],
            prompt="无限",
            random=True                      #这里表示是个随机话题其他部分不再赘述
        )
    )

label moonika_infinity:
    m 1eub "对了,[player],不知道你小时候有没有无意间犯过这个错误."
    m 3eub "你知道的,小孩子们常常爱比谁说的数字大."
    m 3eub "比如一个孩子说‘我比你厉害十倍’,另外一个孩子就会说‘我比你厉害一百倍’.个十百千万,以此类推."
    m 3tub "这种情况会反反复复持续到一个孩子知道‘无限’这个概念.孩子们比赛时就会开始喊‘无限大加一’、‘两个无限大’,仿佛这样就赢了别人."
    m 3rub "但其实‘无限’这一概念不是静态的,而是动态的.它反映了一种趋势,而非一个具体的值."
    m 3euc "嗯... {w=1.5} 你可以这么理解‘无限’的概念：与其说‘无限’是孩子们互相比较时提到的一个具体的值,不如说它是孩子们互相攀比的这个过程本身."
    m 3euc "无论你说出多大的一个数字,在‘无限大’的趋势下永远会有一个更大的数字存在."
    m 1eub " ‘无限’这个概念其实是学习数学的重要基石.我们所熟知的无限循环小数就是最简单的例子."
    m 1eub "同时,‘无限’也被用在几何学的定义当中.{w=1}对于一个正n边形,当边数趋近于无穷大时,它的周长和面积无限接近圆的值.{w=1}阿基米德就是利用此法估算了π的值呢"
    m 3eub "对了,‘旅馆悖论’、‘芝诺悖论’,乃至黄金比例和微积分都和‘无限’的概念有关哦~"
    m 1gup "hmm,让我再想想还有什么有着‘无限’的趋势……{w=2}不断延伸、永不终止……{w=1.5}"
    m 3hubfb "哦对了！还有我对你无限的爱哦,[player]！"

    return"love"                    