init 5 python:
    addEvent(
        Event(
            persistent.event_database,
            eventlabel="moonika_human_blushing",
            category=["情感"],
            prompt="脸红",
            random=True                      #这里表示是个随机话题其他部分不再赘述
        )
    )

label moonika_human_blushing:
    m 5etb "我最近在思考为什么我们会脸红……"
    m 5eub "想想看,[player],我们所熟知的各种动物,包括我们的近亲猩猩,都不会有脸红这种生理机制."
    m 5eub "事实上,人类是唯一会因情绪波动而脸红的动物呢！"
    m 5eub "至于为什么只有人类会有这一种生理机制,科学家们给出了好几种可能的解释."
    m 3lub "比如说,脸红与自我反思及道德判断相关.这些能力依赖于发达的前额叶皮层,所以其他动物或许尚未发展出同等复杂的社会认知."
    m 3rub "同时,这也有可能是因为我们人类是社会性动物.而脸红就是一种非语言的道歉信号,用于缓和社交冲突."
    m 3eub "毕竟脸红是难以刻意控制的嘛……{w=1}有些人虽然有着很强的撒谎能力,但是在尴尬、羞耻和害羞的时候也还是会不自觉地脸红哦~"
    m 1eublb "这种反差感也导致‘脸红’常常和浪漫元素关联在一起.很多动漫更是用‘脸红’来塑造人物可爱的一面."
    menu:                                    
        "[m_name],你脸红的时候就很可爱哦~":                            
            m 1ekbfb "唔…{w=1.5}[player],你说的我都要害羞了！"
            m 1ekbfb "这么突然地撩我,你个坏蛋！好过分……"
            m 6eublsdlb "噗！哈哈,抱歉,我自己都绷不住了."
            m 6tublb "我演的像不像动漫女主脸红时的反应？"
            m 6ttblu "你刚才肯定觉得这么说一定能撩的我脸红心跳了~"
            m 6tfblb "说不定还为自己能抓住这么个机会打我个措手不及而沾沾自喜呢~"
            m 6ttblb "被我猜中小心思了吗？{w=2}可不要没撩到我,自己反而脸红了哟~"
            m 7tublu "轮到我对你这么说了哦！{w=1}[player],你脸红的时候也很可爱哦~"
            m 1mkb "唔……{w=3}但是我确实不得不承认啦~"
            m 1mkbfb "每当我和你在一起的时候,我的脸都会不自觉地泛红呢……{w=2}"
            m 1fkbfb "[player],爱你哦~"
            $ mas_gainAffection(0.520, bypass=True)

            return"love"                  