init 5 python:
    addEvent(
        Event(
            persistent.event_database,
            eventlabel="moonika_mouses",
            category=["莫妮卡","生活"],
            prompt="回归自然",
            random=True                      #这里表示是个随机话题其他部分不再赘述
        )
    )

label moonika_mouses:
    m 3eub "[player],你听过乡下老鼠和城里老鼠的故事吗？"
    m 3eua "一只乡下的老鼠碰到了一只城里的老鼠.一番交谈后,乡下老鼠邀请城市老鼠体验田园生活."
    m 3eta "城里老鼠因不习惯简陋饮食转而邀请乡下老师去了城里.虽然城里吃穿不愁,可乡下老鼠也习惯不了城里危机四伏的生活."
    m 3eua "最终,两只老鼠互相道别,回归了各自的生活."
    m 1eua "在艺术创作当中,城市和乡村,或者小城市和大城市,常常作为对立的意向出现."
    m 1eua "二者常常用来指代两种不同的生活方式：慢节奏、平淡安逸的生活和快节奏、跌宕起伏的生活."
    m 5etb "[player],你认为你是乡下老鼠还是城里老鼠呢？"
    menu:
        "我觉得我是乡下老鼠":
            m 1eua "嗯,平平淡淡才是真嘛~"
            m 1dubsa "和你一起过慢节奏的生活...{w=2}{nw}"
            extend 1eubsa "我觉得也挺好的~"

        "我觉得我是城里老鼠":
            m 5etb "嗯,喜欢刺激和竞争是吗？"
            m 5tta "不愧是我莫妮卡欣赏的人嘛~"

        "或许两者都是？":
            m 5eub "嗯,我自己也不是很确定呢.有时候不同的生活体验都有一点也挺好的."
            m 3hublb "反正只要我俩在一起,生活总归不会差的嘛~"

    return              