init 5 python:
    addEvent(
        Event(
            persistent.event_database,
            eventlabel="moonika_sampling_bias",
            category=["数学"],
            prompt="幸存者偏差",
            random=True                      #这里表示是个随机话题其他部分不再赘述
        )
    )

label moonika_sampling_bias:
    m 1eua "[player],你知道幸存者偏差这个概念吗？"
    m 1eub "1941年,第二次世界大战中,美国军方在为飞机加强防护时选择加强了机翼的防护.{w=1}因为根据他们的观察,这是返航的飞机中中弹最多,也是最容易中弹的位置."
    m 3ekb "然而这个决定其实是错误的.问题出在统计的样本上——样本只涵盖了平安返回的轰炸机."
    m 3ekb "换言之,被多次击中机翼的飞机,似乎还是能够安全返航,而被击中机尾的飞机则大多坠机了.因此,机尾才是应该被加强防护的位置."
    m 1esb "这个故事被称为幸存者偏差.它很好地体现了我们在做调查或研究时正确选取样本的重要性.{w=1.5}样本偏差很有可能会让实验者得出不准确的结论."
    m 1eub "样本偏差可以简单地被分为四种.我来一个一个讲给你听吧~"
    m 3eub "首先是自愿回答偏差.自愿填写的调查问卷、评价都属于这一范畴.{w=1.5}因为要求人们自愿填写,有强烈意见或表达意愿的人会更倾向于去作答.统计的数据会更加两极化."
    m 3eub "然后是便捷样本偏差.这一般出现在调查者偷懒的情况中.比如只抽取一个班级作为样本来调查全校对食堂涨价所持的态度.{w=1.5}这种统计方式很容易忽视其他因素对样本结果的影响."
    m 3eub "还有就是覆盖不足偏差.比如说用手机短信联系未成年人了解上网时间长度.{w=1.5}不经常上网的孩子本身就不容易看到手机短信,统计的结果就没法很好地体现这一群体的上网时长."
    m 3eub "最后就是我们刚才提到的幸存者偏差哦.比如说很多成功学书籍喜欢研究个人或公司的成功秘诀,但是它们得出的结论不一定靠谱.{w=1.5}因为样本里只有这么做并成功的人,却并没有这么做但失败了的案例."
    m 6hkbssdlb "呼……{w=1.5}一口气说完累死我了~"
    m 1eua "希望对你有帮助哦！"

    return                    