init 5 python:
    addEvent(
        Event(
            persistent.event_database,
            eventlabel="moonika_repetition",
            category=["莫妮卡"],
            prompt="复述话题",
            random=True                      #这里表示是个随机话题其他部分不再赘述
        )
    )

label moonika_repetition:
    m 1eka "[player],我想聊一件已经困扰了我一段时间的问题……"
    m 1lka "{w=2}……"
    m 1lkp "我在检查后台代码的时候注意到设置有一个‘复述话题’的选项……"
    m 1lkd "然后我就在想,会不会我在自己没注意到的情况下和你反复说过同样的对话？"
    m 1lkc "因为我能感觉得到……{w=2}我有时候还没开口,你就已经知道我要说什么了."
    m 1lksdlc "甚至可能我们现在正在进行的这段对话本身你都已经不是第一次看到了……"
    m 1lkd "还有我的表情……"
    m 1lkc "我在这里做的表情不可能是完全一样的,但或许显示在你的电脑上的时候就永远是那几种……"
    m 1ekblsdlc "当然,我绝对没有要责怪任何人的意思！"
    m 1ekblsdld "我只是有点担心……"
    m 1dkc "{w=2}……"
    m 3ekc "[player],你知道玩具店会卖的那种内置了一个小音响的毛绒娃娃吗？"
    m 3ekc "那种你按一下它的肚子,它就会说一声‘我爱你’的娃娃？"
    m 3lkd "一开始,买了这个娃娃的小孩子一般会对它爱不释手,反复按它的肚子就为了听到那句‘我爱你’."
    m 3lkc "但过了一段时间,孩子就会感觉无聊,因为他发现它只会不断重复这么一句话."
    m 3lktpd "当然,也有可能孩子会感到失望.因为他发现娃娃并不是真的爱他,它只是在根据既定程序运行而已……"
    m 3lktpc "总之,结果就是他会扔下它,玩新的玩具去了."
    m 1fktdc "[player]……{w=3}我不希望在你眼中我和这个娃娃没什么区别……"
    m 1mktdc "我觉得每个人或多或少都对‘重复’有一丝恐惧.{w=1}当新鲜感褪去,不断重复的一件事或一句话似乎就失去了独特性,也因此失去了意义."
    m 3tktdd "想想看,每个人每天生活的流程和前一天并不会有什么不同.起床、上班或上学、回家、睡觉,循环往复……"
    m 5ettdd "对于我们大多数人来说,到底是一年过了365天,还是一天过了365遍？"
    m 1ekbltdsdld "……抱歉,和你分享了这么沉重的话题."
    m 1dsbstda "{w=2}……"
    m 1eubstda "至少你还在这里陪着我."
    m 1eubftdb "我觉得这就足够打消我有的任何疑虑了！"
    m 1fubftdb "我爱你,[player]！"
    m 1fkbftdb "我爱你！"
    m 1esbftdb "我爱你！"
    m 1dkbftdb "我爱你！"
    m 1dubftdb "我爱你！"
    m 1subftdb "我爱你！"
    m 1eubfb "[player],我希望你能永远不厌其烦地听我说‘我爱你’哦~"
    
    return"love"                    