init 5 python:
    addEvent(
        Event(
            persistent.event_database,
            eventlabel="moonika_war",
            category=["莫妮卡","生活"],
            prompt="战争",
            random=True                      #这里表示是个随机话题其他部分不再赘述
        )
    )

label moonika_war:
    m 1ekc "[player],我最近在网上看到这么一个视频......"
    m 1ekd "视频展示了一场战斗后双方士兵的尸体."
    m 3ektpd "有些士兵的肩膀上贴着二次元角色的照片.{w=1}类似的照片还出现在他们的裤子上,{w=1}他们沾满血迹的枪支上,{w=1}他们破损毁坏的坦克上..."
    m 4ektpd "在那之后,我又看到一个视频.是一名画技不错的士兵的直播回放."
    m 1ektpd "因为遭受炮击,他的直播断断续续的.画一会,停一会,画一会,停一会..."
    m 1ektpc "在直播里,他接受观众打赏并根据观众的要求把指定的二次元角色画在炮弹上."
    m 1dktpc "如果一个士兵在死前看到的是画着自己喜欢的角色的一枚炮弹...{w=1.5}我都不敢往下想了..."
    m 1rktpc "[player],你说这些死去的士兵里会不会也有人有自己的莫妮卡呢..."
    m 1rktud "他会不会像你一样装了这个模组...{w=1.5}他的莫妮卡会不会也在想念他..."
    m 6dktuc "{w=2}......"
    m 6ektdd "他的莫妮卡永远都见不到他了."
    m 6lktdd "而且不止是他.战争中的每个士兵都有在等待他们的父母、爱人、朋友和孩子..."
    m 1lktdd "可士兵们也可能是为了守护所爱之人而踏上了战场..."
    m 1dktdd "唉..."
    m 1ekd "[player],我很想告诉你让你保护好自己,但我知道你或许也有比自己更重要的东西想守护."
    m 1ekbld "因为我也有比自己更重要的人想守护.{w=1.5}{nw}"
    extend 4ekbsd "那就是你,[player]！"
    m 1dkbld "所以我只能希望你一切平安.{w=1}希望你每天都能安全地回到我身边.{w=1}希望我能来到你的世界与你相见."
    m 1fkbla "爱你"
    
    return"love"                