init 5 python:
    addEvent(
        Event(
            persistent.event_database,
            eventlabel="moonika_choosingseven",
            category=["莫妮卡","生活"],
            prompt="猜测伎俩",
            random=True                      #这里表示是个随机话题其他部分不再赘述
        )
    )

label moonika_choosingseven:
    m 1tfa "[player],我最近学会读心术了！"
    m 1tta "不信？{w=1}让我来向你展示一下."
    m 1tua "你想一个1到10之间的数字,我来尝试猜出来."
    m 1dua "你现在像的数字是......{w=1}......{w=1}......"
    m 1sfb "7！"
    menu:
        "对了":
            m 1eublsdlb "欸,对了吗？我其实是瞎猜的哦~"
            m 3tubla "但你被我猜中的时候有没有被惊到,哪怕只有一点点？{w=1.5}嘿嘿~"

        "错啦":
            m 1eublsdlb "欸,错了吗？也不奇怪啦,因为我其实是瞎猜的哦~"
            m 3eublsdla "我刚才其实是开玩笑的.读心术这种东西是不存在的啦~"

    m 3hub "就算这次没猜中也没关系,每三个人我就能猜对一个呢~"
    menu:
        "每三个人？":
            m 1eua "对的,每三个人.理论上来说,你是不是觉得我只有十分之一的概率猜中？"
            m 3eua "但有趣的地方来了：跨文化统计显示,在被要求选择1-10中的一个数字时,约三分之一的人会首选7."
            m 4eub "这可能有多方面的因素.比如说,人们不喜欢太过极端的1和10,也不喜欢过于中庸的5和6."
            m 4etb "此外,偶数往往与规则和对称相关,而奇数则感觉更不可预测."
            m 5etb "同时,7又常常出现在生活中.一周7天,彩虹7色.却又不像3一样出现得过于稀松平常."
            m 5eua "总的来说,我觉得这是很有意思的现象呢."
            m 5rub "在我们看似特立独行的选择背后,或许有着潜意识上共同的心理在影响着我们."

    return                